SET foreign_key_checks = 0;
TRUNCATE TABLE sido_address;
TRUNCATE TABLE sgg_address;
TRUNCATE TABLE emd_address;
SET foreign_key_checks = 1;

INSERT INTO sido_address (sido_id,sido_name) VALUES
    (1,'서울특별시');
INSERT INTO sgg_address (sgg_id,sgg_name,sido_id) VALUES
    (11110,'종로구',1),
    (11680,'강남구',1),
    (11440,'마포구',1);
-- 각 7개의 동 만 저장
INSERT INTO emd_address (emd_address_id,emd_name,sgg_id) VALUES
    (11110111,'옥인동',11110),
    (11110112,'체부동',11110),
    (11110113,'필운동',11110),
    (11110114,'내자동',11110),
    (11110115,'사직동',11110),
    (11110116,'도렴동',11110),
    (11110108,'통인동',11110),
    (11680101,'역삼동',11680),
    (11680103,'개포동',11680),
    (11680104,'청담동',11680),
    (11680105,'삼성동',11680),
    (11680106,'대치동',11680),
    (11680107,'신사동',11680),
    (11680108,'논현동',11680),
    (11440101,'아현동',11440),
    (11440102,'공덕동',11440),
    (11440103,'신공덕동',11440),
    (11440104,'도화동',11440),
    (11440105,'용강동',11440),
    (11440106,'토정동',11440),
    (11440107,'마포동',11440);


